# 数据准备
# 创建储存背包物品信息的csv文件
import pandas as pd
import numpy as np

# 字符串来自于Umi-OCR读取的书本图片
s = """
1
斧子
32252
68674
2
铜币
225790
471010
3
皇冠
468164
944620
4
钻石雕像
489494
962094
5
翡翠腰带
35384
78344
6
化石
265590
579152
7
金币
497911
902698
8
头盔
800493
1686515
9
墨水
823576
1688691
10
珠宝盒
552202
1056157
11
小刀
323618
677562
12
长剑
382846
833132
13
面具
44676
99192
14
项链
169738
376418
15
欧泊胸针
610876
1253986
16
珍珠项链
854190
1853562
17
箭囊
671123
1320297
18
红宝石戒指
698180
1301637
19
银手镯
446517
859835
20
钟表
909620
1677534
21
校服
904818
1910501
22
毒液
730061
1528646
23
羊毛围巾
931932
1827477
24
十字弓
952360
2068204
25
绝版书
926023
1746556
26
奖杯
978724
2100851
"""
s = s.strip()
s = s.split()
# 每4行数据为一组，分别为index，name，weight，value
# 读取数据
data = []
for i in range(0, len(s), 4):
    data.append(s[i:i+4])
KNAPSACK_ITEMS = pd.DataFrame(data, columns=["index","name", "weight", "value"])

print(KNAPSACK_ITEMS)

# 保存数据
KNAPSACK_ITEMS.to_csv("knapsack_items.csv", index=False)

